apps/data-analysis/traditional/localhost_test_20250820_001957/hey_high_output.txt

Summary:
  Total:	2.6199 secs
  Slowest:	0.3666 secs
  Fastest:	0.0817 secs
  Average:	0.1240 secs
  Requests/sec:	190.8471
  
  Total data:	236000 bytes
  Size/request:	472 bytes

Response time histogram:
  0.082 [1]	|
  0.110 [217]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.139 [219]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.167 [22]	|■■■■
  0.196 [15]	|■■■
  0.224 [1]	|
  0.253 [0]	|
  0.281 [0]	|
  0.310 [13]	|■■
  0.338 [8]	|■
  0.367 [4]	|■


Latency distribution:
  10% in 0.0908 secs
  25% in 0.1001 secs
  50% in 0.1135 secs
  75% in 0.1262 secs
  90% in 0.1529 secs
  95% in 0.2890 secs
  99% in 0.3251 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0817 secs, 0.3666 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.1238 secs, 0.0816 secs, 0.3659 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0030 secs

Status code distribution:
  [200]	500 responses