apps/data-analysis/traditional/localhost_test_20250820_001957/hey_medium_output.txt

Summary:
  Total:	1.9395 secs
  Slowest:	0.2776 secs
  Fastest:	0.0806 secs
  Average:	0.0964 secs
  Requests/sec:	103.1190
  
  Total data:	93800 bytes
  Size/request:	469 bytes

Response time histogram:
  0.081 [1]	|
  0.100 [189]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.120 [0]	|
  0.140 [0]	|
  0.159 [0]	|
  0.179 [0]	|
  0.199 [0]	|
  0.218 [0]	|
  0.238 [0]	|
  0.258 [0]	|
  0.278 [10]	|■■


Latency distribution:
  10% in 0.0821 secs
  25% in 0.0839 secs
  50% in 0.0863 secs
  75% in 0.0904 secs
  90% in 0.0958 secs
  95% in 0.2719 secs
  99% in 0.2775 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0806 secs, 0.2776 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0003 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0963 secs, 0.0805 secs, 0.2773 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	200 responses