apps/data-analysis/traditional/localhost_test_20250820_001957/hey_very_high_output.txt

Summary:
  Total:	3.3671 secs
  Slowest:	0.3963 secs
  Fastest:	0.0836 secs
  Average:	0.1622 secs
  Requests/sec:	296.9876
  
  Total data:	472000 bytes
  Size/request:	472 bytes

Response time histogram:
  0.084 [1]	|
  0.115 [154]	|■■■■■■■■■■■■■■■■■■
  0.146 [343]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.177 [214]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.209 [148]	|■■■■■■■■■■■■■■■■■
  0.240 [35]	|■■■■
  0.271 [31]	|■■■■
  0.302 [37]	|■■■■
  0.334 [13]	|■■
  0.365 [11]	|■
  0.396 [13]	|■■


Latency distribution:
  10% in 0.1080 secs
  25% in 0.1236 secs
  50% in 0.1466 secs
  75% in 0.1873 secs
  90% in 0.2558 secs
  95% in 0.2971 secs
  99% in 0.3840 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0836 secs, 0.3963 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0005 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.1621 secs, 0.0836 secs, 0.3957 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0026 secs

Status code distribution:
  [200]	1000 responses